test/multiphase/multiphaseEulerFoam/populationBalance/negativeDrift/constant/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

airSource
{
    type            massSource;

    selectionMode   all;

    massFlowRate    -0.030785654;

    phase           air;
    rho             thermo:rho.air;

    fieldValues
    {
        f0.air      0;
        f1.air      0;
        f2.air      0;
        f3.air      0;
        f4.air      0;
        f5.air      0;
        f6.air      0;
        f7.air      0;
        f8.air      0;
        f9.air      0;
        f10.air     0;
        f11.air     0;
        f12.air     0;
        f13.air     0;
        f14.air     0;
        f15.air     0;
        f16.air     0;
        f17.air     0;
        f18.air     0;
        f19.air     0;
        f20.air     0;
        f21.air     0;
        f22.air     0;
        f23.air     0;
        f24.air     0;
        f25.air     0;
        f26.air     0;
        f27.air     0;
        f28.air     0;
    }
}

waterSink
{
    type            massSource;

    selectionMode   all;

    massFlowRate    30.785654;

    phase           water;
    rho             thermo:rho.water;

    fieldValues
    {}
}

// ************************************************************************* //
